go_intro.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8"/>
<title></title>
<meta name="author" content="(root)"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.css"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/dist/theme/night.css" id="theme"/>

<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/reveal.js/lib/css/zenburn.css"/>
<!-- If the query includes 'print-pdf', include the PDF print sheet -->





<link rel="stylesheet" href="https://cdn.jsdelivr.net/npm/highlightjs-themes@1.0.0/monokai_sublime.css"/>
</head>
<body>
<div class="reveal">
<div class="slides">
<script type="text/javascript">
window.onload=function(){
  Reveal.initialize({
    center: false,
  });
}
</script>
<section>
<section id="slide-org9d56a63">
<h2 id="org9d56a63">Table of Content</h2>
<div style="font-size: 50%;">

<ul>
<li><a href="#/slide-org116a84e">Drawbacks</a>
<ul>
<li><a href="#/slide-orga04a37e">No Generics</a></li>

</ul></li>
<li><a href="#/slide-org6611703">Important Binaries</a></li>
<li><a href="#/slide-org6d0bbda">JSON</a>
<ul>
<li><a href="#/slide-org6d0bbda">JSON</a></li>
<li><a href="#/slide-orga9f9ba0">Parse JSON</a></li>

</ul></li>

</ul>

</div>
</section>
</section>
<section>
<section id="slide-org116a84e">
<h2 id="org116a84e">Drawbacks</h2>
<div class="outline-text-2" id="text-org116a84e">
</div>
</section>
<section id="slide-orga04a37e">
<h3 id="orga04a37e">No Generics</h3>


</section>
</section>
<section>
<section id="slide-org6611703">
<h2 id="org6611703">Important Binaries</h2>
<div style="font-size: 50%;">
<p>
<br />
</p>

<ul>
<li>goimport</li>
<li>gopls</li>
<li>gofmt</li>

</ul>
</DIV>

</section>
</section>
<section>
<section id="slide-org6d0bbda">
<h2 id="org6d0bbda">JSON</h2>
<div style="font-size: 50%;">
<ul>
<li><a href="#/slide-org6d0bbda">JSON</a></li>
<li><a href="#/slide-orga9f9ba0">Parse JSON</a></li>

</ul>

</div>

</section>
<section id="slide-orgebf44c1">
<h3 id="orgebf44c1">JSON</h3>
<div style="font-size: 50%;">

<p>
<br />
</p>

<p>
<b>Convert JSON to go struct</b>
JSON-to-Go - <a href="https://mholt.github.io/json-to-go/">Here</a>
</p>

<p>
<br />
</p>

<div class="org-src-container">

<pre   ><code class="json" >{
  "page": 2,
  "per_page": 6,
  "total": 12,
  "total_pages": 2,
  "data": [
    {
      "id": 7,
      "email": "michael.lawson@reqres.in",
      "first_name": "Michael",
      "last_name": "Lawson",
      "avatar": "https://reqres.in/img/faces/7-image.jpg"
    },
    {
      "id": 8,
      "email": "lindsay.ferguson@reqres.in",
      "first_name": "Lindsay",
      "last_name": "Ferguson",
      "avatar": "https://reqres.in/img/faces/8-image.jpg"
    },
    {
      "id": 9,
      "email": "tobias.funke@reqres.in",
      "first_name": "Tobias",
      "last_name": "Funke",
      "avatar": "https://reqres.in/img/faces/9-image.jpg"
    },
    {
      "id": 10,
      "email": "byron.fields@reqres.in",
      "first_name": "Byron",
      "last_name": "Fields",
      "avatar": "https://reqres.in/img/faces/10-image.jpg"
    },
    {
      "id": 11,
      "email": "george.edwards@reqres.in",
      "first_name": "George",
      "last_name": "Edwards",
      "avatar": "https://reqres.in/img/faces/11-image.jpg"
    },
    {
      "id": 12,
      "email": "rachel.howell@reqres.in",
      "first_name": "Rachel",
      "last_name": "Howell",
      "avatar": "https://reqres.in/img/faces/12-image.jpg"
    }
  ],
  "support": {
    "url": "https://reqres.in/#support-heading",
    "text": "To keep ReqRes free, contributions towards server costs are appreciated!"
  }
}
</code></pre>
</div>

</div>

</section>
<section id="slide-orga9f9ba0">
<h3 id="orga9f9ba0">Parse JSON</h3>
<div style="font-size: 50%;">

<div class="org-src-container">

<pre   ><code class="go" >package main

import (
    "encoding/json"
    "fmt"
    "io/ioutil"
    "net/http"
)
type Response struct {
    Page       int `json:"page"`
    PerPage    int `json:"per_page"`
    Total      int `json:"total"`
    TotalPages int `json:"total_pages"`
    Data       []struct {
	ID        int    `json:"id"`
	ail     string `json:"email"`
	FirstName string `json:"first_name"`
	LastName  string `json:"last_name"`
	Avatar    string `json:"avatar"`
    } `json:"data"`
    Support struct {
	URL  string `json:"url"`
	Text string `json:"text"`
    } `json:"support"`
}

func main() {

    // Get request
    resp, err := http.Get("https://reqres.in/api/users?page=2")
    if err != nil {
	fmt.Println("No response from request")
    }
    defer resp.Body.Close()
    body, err := ioutil.ReadAll(resp.Body) // response body is []byte

    var result Response
    if err := json.Unmarshal(body, &amp;result); err != nil {  // Parse []byte to the go struct pointer
	fmt.Println("Can not unmarshal JSON")
    }


    // Loop through the data node for the FirstName
    for _, rec := range result.Data {
	fmt.Println(rec.FirstName)
    }
}

// PrettyPrint to print struct in a readable way
func PrettyPrint(i interface{}) string {
    s, _ := json.MarshalIndent(i, "", "\t")
    return string(s)
}
</code></pre>
</div>


</div>
</section>
</section>
</div>
</div>
<script src="https://cdn.jsdelivr.net/npm/reveal.js/dist/reveal.js"></script>

<script>
// Full list of configuration options available here:
// https://github.com/hakimel/reveal.js#configuration
Reveal.initialize({
transition: 'none',

// Optional libraries used to extend on reveal.js
dependencies: [
 { src: 'https://cdn.jsdelivr.net/npm/reveal.js/plugin/highlight/highlight.js', async: true, callback: function() { hljs.initHighlightingOnLoad(); } }]

});

</script>
</body>
</html>
